Repository: ubports/weather-app
Catalog: po/*.po
Languages: sc

source: Chance of precipitation
sc: Possibilidade de abba

source: Winds
sc: Bentu

source: UV Index
sc: Ìnditze UV

source: Pollen
sc: Pòddine

source: Humidity
sc: Umidade

source: Sunrise
sc: Arbèschida

source: Sunset
sc: Iscurigadorzu

source: Locations
sc: Positziones

source: Cancel selection
sc: Annulla sa seletzione

source: Delete
sc: Cantzella

source: Searching for current location...
sc: Chirchende sa positzione atuale...

source: Cannot determine your location
sc: Impossìbile determinare sa positzione

source: Today
sc: Oe

source: updated %1 hour ago
sc: atualizadu %1 ora a como

source: updated %1 minute ago
sc: atualizadu %1 minutu a como

source: updated recently
sc: atualizadu de reghente

source: Remove
sc: Cantzella

source: Network Error
sc: Errore de rete

source: Please check your network settings and try again.
sc: Controlla sa cunfiguratzione de rete e torra·bi a proare.

source: Retry
sc: Torra·bi a proare

source: No API Keys Found
sc: Peruna crae API agatada

source: Select a city
sc: Seletziona una tzitade

source: City
sc: Tzitade

source: Back
sc: In segus

source: Search city
sc: Chirca tzitade

source: No city found
sc: Peruna tzitade agatada

source: Couldn't load weather data, please try later again!
sc: Impossìbile carrigare datos meteorològicos, torra·bi a proare a pustis!

source: OK
sc: AB

source: Current Location
sc: Positzione atuale

source: Settings
sc: Cunfiguratzione

source: Units
sc: Unidades

source: Data Provider
sc: Fornidore de datos

source: Location
sc: Positzione

source: Provider
sc: Fornidore

source: Detect current location
sc: Rileva sa positzione atuale

source: %1 minute
sc: %1 minutu

source: Interval
sc: Intervallu

source: kph
sc: km/h

source: Temperature
sc: Temperadura

source: Wind Speed
sc: Velotzidade de su bentu

source: Weather
sc: Meteo

source: weather;forecast;twc;openweathermap;the weather channel;
sc: meteo;previsione;twc;openweathermap;the weather channel;
